app/tanium/bin/xml/getsaved_template.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<soap:Body>
		<tanium_soap_request xmlns="urn:TaniumSOAP">
			<auth>
				<username>%s</username>
				<password>%s</password>
			</auth>
			<command xmlns="">%s</command>
			<object_list xmlns="">
				<saved_question>
					<name>%s</name>
				</saved_question>
			</object_list>
			<options xmlns="">
				<flags>1</flags>
			</options>
			<ID xmlns="">0</ID>
			<ContextID xmlns="">0</ContextID>
		</tanium_soap_request>
	</soap:Body>
</soap:Envelope>